package com.callo.apps.service;

/* 
 * EVen~V3에 아무코드도 없지만 실행이 된다 
 * >>Even V1_B에 내용을 그대로 변경없이 사용
 * 객체지향 프로그래밍 
 * =java는 객체지향 프로그래밍을 가장 완벽하게 
 * 			구현한 최초의 프로그래밍 언어
 * 
 *1.특징 1 : 상속, Extends(확장)
 * 			 이미 만들어지 클래스의 소스코드를 사용하여
 * 			 내 프로젝트에 정용하고자 할때,
 *  		 코드를 복사 붙이기 할 수 있다
 *  
 *  하지만 복사, 붙이기 한 코드는 원래 클래스의 코드가 변경되면
 *  다시 반영하기가 매우 어렵다.
 *  
 *  클래스를 상송하게되면 복사 붙이기 한것과 유사하게 기능을 
 *  사용하면서
 *  원래 클래스의 코드가 확장되면, 상솟받은 코드에서 확장된
 *  부분이 자동으로 반영되는 효과를 낼수있다.
 *  
 *  하지만 단순히 상속받는 것 만으로 객체지향의 특징을 잘 
 *  나타낸다고 할 수 없다. 
 *  
 *  객체지향에서 상속은 단순히 코드를 이어받아 사용하는 것 뿐만 아니라
 *  
 *  이미 만들어진 method를 사용하면서
 *  필요에 따라 일부 method를 나만의 방식으로
 *  변경(확장)하여 작성할 수 있음.
 *  
 *  V1_B 클래스에 a(),b(),c(), method가 있다고 가정할때
 *  V1_B 클래스에 구현된 a(), b() , c() method는 그대로
 *  기능을 사용하면서
 *  b() method만 나만의 방식으로 다시 작성하여 사용할 수 있다.
 *  V2 클래스를 만드는 개발자는 V1_B의 method를 대부분
 *  그대로 사용하면서, 일부만 변경을 하기 때문에
 *  개발을 하는데 많은 시간을 절약할수 있음
 *  
 *  ==> 코드의 재사용 장점이라고 한다.
 *  
 */
public class EvenServiceV3 extends EvenServiceV1_B{

	
}
