package com.callor.apps.service;

public class LinesService {

	/* 클래스영역에 변수를 선언할때
	 * public static 키워드를 부착하고 
	 * 변수값을 저장하여 만들어두면 "프로젝트 안"에서 어디에서든
	 * 그 변수에 저장된 값을 사용가능
	 * 
	 * 프로젝트 안에 전체 에서 자주 사용하는 어떤 값을 
	 * 변수에 미리 설정(저장) 해두고 사용하는 방법
	 * 
	 * static(정적) 변수
	 */
	public static String dLine="=========================================================================================";
	public static String sLine="-----------------------------------------------------------------------------------------";
//public static이 붙으면 어디에서든지 사용가능 >> static(정적) 변수
}
